# Solve the advent of code day 1 puzzle

## Part 1

### Example input

In [1]:
import pandas as pd

In [2]:
ex_data = pd.read_fwf('day1.example.input', header = None, names = ['col0', 'col1'])
ex_data.head()

   col0  col1
0     3     4
1     4     3
2     2     5
3     1     3
4     3     9

In [3]:
# Sort columns
ex_data['col0_lo_to_hi'] = ex_data['col0'].sort_values(ascending = True, ignore_index = True)
ex_data['col1_lo_to_hi'] = ex_data['col1'].sort_values(ascending = True, ignore_index = True)
ex_data.head()

   col0  col1  col0_lo_to_hi  col1_lo_to_hi
0     3     4              1              3
1     4     3              2              3
2     2     5              3              3
3     1     3              3              4
4     3     9              3              5

In [4]:
# Compute delta sum
abs(ex_data['col0_lo_to_hi'] - ex_data['col1_lo_to_hi']).sum()

11

### Puzzle input

In [5]:
data = pd.read_fwf('day1.input', header = None, names = ['col0', 'col1'])
data.head()

    col0   col1
0  98415  86712
1  21839  96206
2  14958  40971
3  91380  63825
4  48482  40971

In [6]:
# Sort columns
data['col0_lo_to_hi'] = data['col0'].sort_values(ascending = True, ignore_index = True)
data['col1_lo_to_hi'] = data['col1'].sort_values(ascending = True, ignore_index = True)
data.head()

    col0   col1  col0_lo_to_hi  col1_lo_to_hi
0  98415  86712          10029          10138
1  21839  96206          10060          10152
2  14958  40971          10113          10331
3  91380  63825          10126          10409
4  48482  40971          10147          10695

In [7]:
# Compute delta sum
abs(data['col0_lo_to_hi'] - data['col1_lo_to_hi']).sum()

2192892

## Part 2

### Example input

In [39]:
# Compute the similarity score for each value in col1
ex_counts = ex_data['col1'].value_counts()
ex_scores = ex_counts.values * ex_counts.index.to_numpy()
ex_sim_scores = pd.Series(data = ex_scores, index = ex_counts.index)
ex_sim_scores

3    9
4    4
5    5
9    9
dtype: int64

In [40]:
# Compute the total similarity score for all values in column 0
ex_total_sim_score = 0
ex_col0 = ex_data['col0'].to_list()
for x in ex_col0:
    try:
        ex_sim_score = ex_sim_scores[x]
    except KeyError:
        continue
    ex_total_sim_score = ex_total_sim_score + ex_sim_score
print(ex_total_sim_score)

31

### Puzzle input

In [43]:
# Compute the similarity score for each value in col1
counts = data['col1'].value_counts()
scores = counts.values * counts.index.to_numpy()
sim_scores = pd.Series(data = scores, index = counts.index)

In [44]:
# Compute the total similarity score for all values in column 0
total_sim_score = 0
col0 = data['col0'].to_list()
for x in col0:
    try:
        sim_score = sim_scores[x]
    except KeyError:
        continue
    total_sim_score = total_sim_score + sim_score
print(total_sim_score)

22962826